[Survived] BlockStatement
src/lib/supervision.ts:19:59
   UpdateNoteInput,
 } from "@/lib/database";
 
-function toError(error: unknown, fallbackMessage: string) {
-  if (error instanceof Error) {
-    return error;
-  }
-
-  if (error && typeof error === "object") {
-    const message =
-      "message" in error && typeof error.message === "string" && error.message.length > 0
-        ? error.message
-        : fallbackMessage;
-    const details =
-      "details" in error && typeof error.details === "string" && error.details.length > 0 ? error.details : null;
-    const hint = "hint" in error && typeof error.hint === "string" && error.hint.length > 0 ? error.hint : null;
-    const code = "code" in error && typeof error.code === "string" && error.code.length > 0 ? error.code : null;
-
-    return new Error([message, details, hint, code ? `code: ${code}` : null].filter(Boolean).join(" | "));
-  }
-
-  return new Error(fallbackMessage);
-}
+function toError(error: unknown, fallbackMessage: string) {}
 
 function groupItemsByNoteId(items: NoteItemRow[]) {

[Killed] ConditionalExpression
src/lib/supervision.ts:20:7
 } from "@/lib/database";
 
 function toError(error: unknown, fallbackMessage: string) {
-  if (error instanceof Error) {
+  if (true) {
     return error;
   }
killedBy: supervision read model continuity surfaces student lookup errors instead of silently returning null
statusReason: expected [Function] to throw error including 'student lookup failed | code: 42501' but got 'student lookup failed'

[NoCoverage] BlockStatement
src/lib/supervision.ts:20:31
 } from "@/lib/database";
 
 function toError(error: unknown, fallbackMessage: string) {
-  if (error instanceof Error) {
-    return error;
-  }
+  if (error instanceof Error) {}
 
   if (error && typeof error === "object") {

[Killed] EqualityOperator
src/lib/supervision.ts:24:16
     return error;
   }
 
-  if (error && typeof error === "object") {
+  if (error && typeof error !== "object") {
     const message =
       "message" in error && typeof error.message === "string" && error.message.length > 0
killedBy: supervision read model continuity surfaces student lookup errors instead of silently returning null
statusReason: expected [Function] to throw error including 'student lookup failed | code: 42501' but got 'Unable to load the selected student.'

[Killed] ConditionalExpression
src/lib/supervision.ts:24:7
     return error;
   }
 
-  if (error && typeof error === "object") {
+  if (false) {
     const message =
       "message" in error && typeof error.message === "string" && error.message.length > 0
killedBy: supervision read model continuity surfaces student lookup errors instead of silently returning null
statusReason: expected [Function] to throw error including 'student lookup failed | code: 42501' but got 'Unable to load the selected student.'

[Killed] ConditionalExpression
src/lib/supervision.ts:26:7
 
   if (error && typeof error === "object") {
     const message =
-      "message" in error && typeof error.message === "string" && error.message.length > 0
+      false
         ? error.message
         : fallbackMessage;
killedBy: supervision shared note update contract surfaces note update persistence errors instead of continuing with a partial shared-note edit
statusReason: expected [Function] to throw error including 'note update failed | code: 42501' but got 'Unable to update the note. | code: 42…'

[Killed] EqualityOperator
src/lib/supervision.ts:26:66
 
   if (error && typeof error === "object") {
     const message =
-      "message" in error && typeof error.message === "string" && error.message.length > 0
+      "message" in error && typeof error.message === "string" && error.message.length <= 0
         ? error.message
         : fallbackMessage;
killedBy: supervision shared note update contract surfaces note update persistence errors instead of continuing with a partial shared-note edit
statusReason: expected [Function] to throw error including 'note update failed | code: 42501' but got 'Unable to update the note. | code: 42…'

[Killed] ConditionalExpression
src/lib/supervision.ts:30:7
         ? error.message
         : fallbackMessage;
     const details =
-      "details" in error && typeof error.details === "string" && error.details.length > 0 ? error.details : null;
+      true && error.details.length > 0 ? error.details : null;
     const hint = "hint" in error && typeof error.hint === "string" && error.hint.length > 0 ? error.hint : null;
     const code = "code" in error && typeof error.code === "string" && error.code.length > 0 ? error.code : null;
killedBy: supervision read model continuity surfaces student lookup errors instead of silently returning null
statusReason: expected [Function] to throw error including 'student lookup failed | code: 42501' but got 'Cannot read properties of undefined (…'

[Killed] LogicalOperator
src/lib/supervision.ts:30:7
         ? error.message
         : fallbackMessage;
     const details =
-      "details" in error && typeof error.details === "string" && error.details.length > 0 ? error.details : null;
+      "details" in error && typeof error.details === "string" || error.details.length > 0 ? error.details : null;
     const hint = "hint" in error && typeof error.hint === "string" && error.hint.length > 0 ? error.hint : null;
     const code = "code" in error && typeof error.code === "string" && error.code.length > 0 ? error.code : null;
killedBy: supervision shared note update contract surfaces note update persistence errors instead of continuing with a partial shared-note edit
statusReason: expected [Function] to throw error including 'note update failed | code: 42501' but got 'Cannot read properties of undefined (…'

[Killed] LogicalOperator
src/lib/supervision.ts:31:18
         : fallbackMessage;
     const details =
       "details" in error && typeof error.details === "string" && error.details.length > 0 ? error.details : null;
-    const hint = "hint" in error && typeof error.hint === "string" && error.hint.length > 0 ? error.hint : null;
+    const hint = "hint" in error && typeof error.hint === "string" || error.hint.length > 0 ? error.hint : null;
     const code = "code" in error && typeof error.code === "string" && error.code.length > 0 ? error.code : null;
 
killedBy: supervision shared note update contract surfaces note update persistence errors instead of continuing with a partial shared-note edit
statusReason: expected [Function] to throw error including 'note update failed | code: 42501' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/lib/supervision.ts:31:18
         : fallbackMessage;
     const details =
       "details" in error && typeof error.details === "string" && error.details.length > 0 ? error.details : null;
-    const hint = "hint" in error && typeof error.hint === "string" && error.hint.length > 0 ? error.hint : null;
+    const hint = true && error.hint.length > 0 ? error.hint : null;
     const code = "code" in error && typeof error.code === "string" && error.code.length > 0 ? error.code : null;
 
killedBy: supervision shared note update contract surfaces note update persistence errors instead of continuing with a partial shared-note edit
statusReason: expected [Function] to throw error including 'note update failed | code: 42501' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/lib/supervision.ts:32:18
     const details =
       "details" in error && typeof error.details === "string" && error.details.length > 0 ? error.details : null;
     const hint = "hint" in error && typeof error.hint === "string" && error.hint.length > 0 ? error.hint : null;
-    const code = "code" in error && typeof error.code === "string" && error.code.length > 0 ? error.code : null;
+    const code = false ? error.code : null;
 
     return new Error([message, details, hint, code ? `code: ${code}` : null].filter(Boolean).join(" | "));
killedBy: supervision shared note update contract surfaces note update persistence errors instead of continuing with a partial shared-note edit
statusReason: expected [Function] to throw error including 'note update failed | code: 42501' but got 'note update failed'

[Killed] EqualityOperator
src/lib/supervision.ts:32:71
     const details =
       "details" in error && typeof error.details === "string" && error.details.length > 0 ? error.details : null;
     const hint = "hint" in error && typeof error.hint === "string" && error.hint.length > 0 ? error.hint : null;
-    const code = "code" in error && typeof error.code === "string" && error.code.length > 0 ? error.code : null;
+    const code = "code" in error && typeof error.code === "string" && error.code.length <= 0 ? error.code : null;
 
     return new Error([message, details, hint, code ? `code: ${code}` : null].filter(Boolean).join(" | "));
killedBy: supervision shared note update contract surfaces note update persistence errors instead of continuing with a partial shared-note edit
statusReason: expected [Function] to throw error including 'note update failed | code: 42501' but got 'note update failed'

[Killed] MethodExpression
src/lib/supervision.ts:34:22
     const hint = "hint" in error && typeof error.hint === "string" && error.hint.length > 0 ? error.hint : null;
     const code = "code" in error && typeof error.code === "string" && error.code.length > 0 ? error.code : null;
 
-    return new Error([message, details, hint, code ? `code: ${code}` : null].filter(Boolean).join(" | "));
+    return new Error([message, details, hint, code ? `code: ${code}` : null].join(" | "));
   }
 
killedBy: supervision shared note update contract surfaces note update persistence errors instead of continuing with a partial shared-note edit
statusReason: expected [Function] to throw error including 'note update failed | code: 42501' but got 'note update failed |  |  | code: 42501'

[Killed] BlockStatement
src/lib/supervision.ts:40:51
   return new Error(fallbackMessage);
 }
 
-function groupItemsByNoteId(items: NoteItemRow[]) {
-  return items.reduce<Map<string, NoteItemRow[]>>((accumulator, item) => {
-    const existingItems = accumulator.get(item.note_id);
-    if (existingItems) {
-      existingItems.push(item);
-    } else {
-      accumulator.set(item.note_id, [item]);
-    }
-
-    return accumulator;
-  }, new Map());
-}
+function groupItemsByNoteId(items: NoteItemRow[]) {}
 
 export async function listProfessorStudents(supabase: SupabaseClient): Promise<StudentThreadSummary[]> {
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/lib/supervision.ts:41:74
 }
 
 function groupItemsByNoteId(items: NoteItemRow[]) {
-  return items.reduce<Map<string, NoteItemRow[]>>((accumulator, item) => {
-    const existingItems = accumulator.get(item.note_id);
-    if (existingItems) {
-      existingItems.push(item);
-    } else {
-      accumulator.set(item.note_id, [item]);
-    }
-
-    return accumulator;
-  }, new Map());
+  return items.reduce<Map<string, NoteItemRow[]>>((accumulator, item) => {}, new Map());
 }
 
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] ConditionalExpression
src/lib/supervision.ts:43:9
 function groupItemsByNoteId(items: NoteItemRow[]) {
   return items.reduce<Map<string, NoteItemRow[]>>((accumulator, item) => {
     const existingItems = accumulator.get(item.note_id);
-    if (existingItems) {
+    if (true) {
       existingItems.push(item);
     } else {
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/lib/supervision.ts:43:24
 function groupItemsByNoteId(items: NoteItemRow[]) {
   return items.reduce<Map<string, NoteItemRow[]>>((accumulator, item) => {
     const existingItems = accumulator.get(item.note_id);
-    if (existingItems) {
-      existingItems.push(item);
-    } else {
+    if (existingItems) {} else {
       accumulator.set(item.note_id, [item]);
     }
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: expected [ 1 ] to deeply equal [ 1, 2 ]

[Killed] BlockStatement
src/lib/supervision.ts:45:12
     const existingItems = accumulator.get(item.note_id);
     if (existingItems) {
       existingItems.push(item);
-    } else {
-      accumulator.set(item.note_id, [item]);
-    }
+    } else {}
 
     return accumulator;
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] StringLiteral
src/lib/supervision.ts:55:11
 
 export async function listProfessorStudents(supabase: SupabaseClient): Promise<StudentThreadSummary[]> {
   const { data: studentsData, error: studentsError } = await supabase
-    .from("students")
+    .from("")
     .select("id, professor_profile_id, student_profile_id, full_name, email, created_at, updated_at")
     .order("full_name", { ascending: true })
killedBy: professor roster link status surfaces linked, email-ready, and missing-email roster states
statusReason: expected [] to deeply equal [ …(3) ]

[Killed] BooleanLiteral
src/lib/supervision.ts:57:38
   const { data: studentsData, error: studentsError } = await supabase
     .from("students")
     .select("id, professor_profile_id, student_profile_id, full_name, email, created_at, updated_at")
-    .order("full_name", { ascending: true })
+    .order("full_name", { ascending: false })
     .overrideTypes<StudentRow[], { merge: false }>();
 
killedBy: professor roster link status surfaces linked, email-ready, and missing-email roster states
statusReason: expected [ …(3) ] to deeply equal [ …(3) ]

[Killed] StringLiteral
src/lib/supervision.ts:57:12
   const { data: studentsData, error: studentsError } = await supabase
     .from("students")
     .select("id, professor_profile_id, student_profile_id, full_name, email, created_at, updated_at")
-    .order("full_name", { ascending: true })
+    .order("", { ascending: true })
     .overrideTypes<StudentRow[], { merge: false }>();
 
killedBy: professor roster link status surfaces linked, email-ready, and missing-email roster states
statusReason: expected [ Array(3) ] to deeply equal [ …(3) ]

[Killed] ConditionalExpression
src/lib/supervision.ts:60:7
     .order("full_name", { ascending: true })
     .overrideTypes<StudentRow[], { merge: false }>();
 
-  if (studentsError) {
+  if (true) {
     throw toError(studentsError, "Unable to load professor-visible students.");
   }
killedBy: professor roster link status surfaces linked, email-ready, and missing-email roster states
statusReason: Unable to load professor-visible students.

[Survived] ConditionalExpression
src/lib/supervision.ts:60:7
     .order("full_name", { ascending: true })
     .overrideTypes<StudentRow[], { merge: false }>();
 
-  if (studentsError) {
+  if (false) {
     throw toError(studentsError, "Unable to load professor-visible students.");
   }

[NoCoverage] StringLiteral
src/lib/supervision.ts:61:34
     .overrideTypes<StudentRow[], { merge: false }>();
 
   if (studentsError) {
-    throw toError(studentsError, "Unable to load professor-visible students.");
+    throw toError(studentsError, "");
   }
 

[Killed] EqualityOperator
src/lib/supervision.ts:65:7
   }
 
   const students = studentsData;
-  if (students.length === 0) {
+  if (students.length !== 0) {
     return [];
   }
killedBy: professor roster link status surfaces linked, email-ready, and missing-email roster states
statusReason: expected [] to deeply equal [ …(3) ]

[Killed] ConditionalExpression
src/lib/supervision.ts:65:7
   }
 
   const students = studentsData;
-  if (students.length === 0) {
+  if (true) {
     return [];
   }
killedBy: professor roster link status surfaces linked, email-ready, and missing-email roster states
statusReason: expected [] to deeply equal [ …(3) ]

[Survived] ArrowFunction
src/lib/supervision.ts:69:35
     return [];
   }
 
-  const studentIds = students.map((student) => student.id);
+  const studentIds = students.map(() => undefined);
   const { data: notesData, error: notesError } = await supabase
     .from("notes")

[Survived] BooleanLiteral
src/lib/supervision.ts:74:41
     .from("notes")
     .select("student_id, meeting_date")
     .in("student_id", studentIds)
-    .order("meeting_date", { ascending: false })
+    .order("meeting_date", { ascending: true })
     .overrideTypes<Pick<NoteRow, "student_id" | "meeting_date">[], { merge: false }>();
 

[Survived] StringLiteral
src/lib/supervision.ts:74:12
     .from("notes")
     .select("student_id, meeting_date")
     .in("student_id", studentIds)
-    .order("meeting_date", { ascending: false })
+    .order("", { ascending: false })
     .overrideTypes<Pick<NoteRow, "student_id" | "meeting_date">[], { merge: false }>();
 

[Killed] ConditionalExpression
src/lib/supervision.ts:77:7
     .order("meeting_date", { ascending: false })
     .overrideTypes<Pick<NoteRow, "student_id" | "meeting_date">[], { merge: false }>();
 
-  if (notesError) {
+  if (true) {
     throw toError(notesError, "Unable to load note summaries for professor-visible students.");
   }
killedBy: professor roster link status surfaces linked, email-ready, and missing-email roster states
statusReason: Unable to load note summaries for professor-visible students.

[NoCoverage] BlockStatement
src/lib/supervision.ts:77:19
     .order("meeting_date", { ascending: false })
     .overrideTypes<Pick<NoteRow, "student_id" | "meeting_date">[], { merge: false }>();
 
-  if (notesError) {
-    throw toError(notesError, "Unable to load note summaries for professor-visible students.");
-  }
+  if (notesError) {}
 
   const notes = notesData;

[NoCoverage] BlockStatement
src/lib/supervision.ts:85:29
   const noteCounts = new Map<string, number>();
   const latestMeetingDates = new Map<string, string>();
 
-  for (const note of notes) {
-    noteCounts.set(note.student_id, (noteCounts.get(note.student_id) ?? 0) + 1);
-    if (!latestMeetingDates.has(note.student_id)) {
-      latestMeetingDates.set(note.student_id, note.meeting_date);
-    }
-  }
+  for (const note of notes) {}
 
   return students.map((student) => ({

[NoCoverage] LogicalOperator
src/lib/supervision.ts:86:38
   const latestMeetingDates = new Map<string, string>();
 
   for (const note of notes) {
-    noteCounts.set(note.student_id, (noteCounts.get(note.student_id) ?? 0) + 1);
+    noteCounts.set(note.student_id, (noteCounts.get(note.student_id) && 0) + 1);
     if (!latestMeetingDates.has(note.student_id)) {
       latestMeetingDates.set(note.student_id, note.meeting_date);

[NoCoverage] ArithmeticOperator
src/lib/supervision.ts:86:37
   const latestMeetingDates = new Map<string, string>();
 
   for (const note of notes) {
-    noteCounts.set(note.student_id, (noteCounts.get(note.student_id) ?? 0) + 1);
+    noteCounts.set(note.student_id, (noteCounts.get(note.student_id) ?? 0) - 1);
     if (!latestMeetingDates.has(note.student_id)) {
       latestMeetingDates.set(note.student_id, note.meeting_date);

[NoCoverage] ConditionalExpression
src/lib/supervision.ts:87:9
 
   for (const note of notes) {
     noteCounts.set(note.student_id, (noteCounts.get(note.student_id) ?? 0) + 1);
-    if (!latestMeetingDates.has(note.student_id)) {
+    if (true) {
       latestMeetingDates.set(note.student_id, note.meeting_date);
     }

[NoCoverage] ConditionalExpression
src/lib/supervision.ts:87:9
 
   for (const note of notes) {
     noteCounts.set(note.student_id, (noteCounts.get(note.student_id) ?? 0) + 1);
-    if (!latestMeetingDates.has(note.student_id)) {
+    if (false) {
       latestMeetingDates.set(note.student_id, note.meeting_date);
     }

[Killed] ArrowFunction
src/lib/supervision.ts:92:23
     }
   }
 
-  return students.map((student) => ({
-    ...student,
-    note_count: noteCounts.get(student.id) ?? 0,
-    last_meeting_date: latestMeetingDates.get(student.id) ?? null,
-    linking_status: student.student_profile_id ? "linked" : student.email ? "claim-ready" : "missing-email",
-  }));
+  return students.map(() => undefined);
 }
 
killedBy: professor roster link status surfaces linked, email-ready, and missing-email roster states
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/lib/supervision.ts:92:37
     }
   }
 
-  return students.map((student) => ({
-    ...student,
-    note_count: noteCounts.get(student.id) ?? 0,
-    last_meeting_date: latestMeetingDates.get(student.id) ?? null,
-    linking_status: student.student_profile_id ? "linked" : student.email ? "claim-ready" : "missing-email",
-  }));
+  return students.map((student) => ({}));
 }
 
killedBy: professor roster link status surfaces linked, email-ready, and missing-email roster states
statusReason: expected [ [ undefined, undefined ], …(2) ] to deeply equal [ …(3) ]

[Survived] LogicalOperator
src/lib/supervision.ts:94:17
 
   return students.map((student) => ({
     ...student,
-    note_count: noteCounts.get(student.id) ?? 0,
+    note_count: noteCounts.get(student.id) && 0,
     last_meeting_date: latestMeetingDates.get(student.id) ?? null,
     linking_status: student.student_profile_id ? "linked" : student.email ? "claim-ready" : "missing-email",

[Survived] LogicalOperator
src/lib/supervision.ts:95:24
   return students.map((student) => ({
     ...student,
     note_count: noteCounts.get(student.id) ?? 0,
-    last_meeting_date: latestMeetingDates.get(student.id) ?? null,
+    last_meeting_date: latestMeetingDates.get(student.id) && null,
     linking_status: student.student_profile_id ? "linked" : student.email ? "claim-ready" : "missing-email",
   }));

[Killed] StringLiteral
src/lib/supervision.ts:96:93
     ...student,
     note_count: noteCounts.get(student.id) ?? 0,
     last_meeting_date: latestMeetingDates.get(student.id) ?? null,
-    linking_status: student.student_profile_id ? "linked" : student.email ? "claim-ready" : "missing-email",
+    linking_status: student.student_profile_id ? "linked" : student.email ? "claim-ready" : "",
   }));
 }
killedBy: professor roster link status surfaces linked, email-ready, and missing-email roster states
statusReason: expected [ …(3) ] to deeply equal [ …(3) ]

[Killed] StringLiteral
src/lib/supervision.ts:107:9
   const studentResult = await supabase
     .from("students")
     .select("id, professor_profile_id, student_profile_id, full_name, email, created_at, updated_at")
-    .eq("id", studentId)
+    .eq("", studentId)
     .maybeSingle();
   const studentData = studentResult.data;
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/lib/supervision.ts:112:7
   const studentData = studentResult.data;
   const studentError = studentResult.error;
 
-  if (studentError) {
+  if (true) {
     throw toError(studentError, "Unable to load the selected student.");
   }
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: Unable to load the selected student.

[Killed] ConditionalExpression
src/lib/supervision.ts:112:7
   const studentData = studentResult.data;
   const studentError = studentResult.error;
 
-  if (studentError) {
+  if (false) {
     throw toError(studentError, "Unable to load the selected student.");
   }
killedBy: supervision read model continuity surfaces student lookup errors instead of silently returning null
statusReason: promise resolved "null" instead of rejecting

[Survived] StringLiteral
src/lib/supervision.ts:113:33
   const studentError = studentResult.error;
 
   if (studentError) {
-    throw toError(studentError, "Unable to load the selected student.");
+    throw toError(studentError, "");
   }
 

[Killed] ConditionalExpression
src/lib/supervision.ts:117:7
   }
 
   const student = studentData;
-  if (!student) {
+  if (true) {
     return null;
   }
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: expected null not to be null

[Killed] BooleanLiteral
src/lib/supervision.ts:117:7
   }
 
   const student = studentData;
-  if (!student) {
+  if (student) {
     return null;
   }
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: expected null not to be null

[Killed] StringLiteral
src/lib/supervision.ts:122:11
   }
 
   const { data: notesData, error: notesError } = await supabase
-    .from("notes")
+    .from("")
     .select("id, student_id, meeting_date, created_by, updated_by, created_at, updated_at")
     .eq("student_id", studentId)
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: expected [] to deeply equal [ 'note-same-date-later', …(2) ]

[Survived] StringLiteral
src/lib/supervision.ts:123:13
 
   const { data: notesData, error: notesError } = await supabase
     .from("notes")
-    .select("id, student_id, meeting_date, created_by, updated_by, created_at, updated_at")
+    .select("")
     .eq("student_id", studentId)
     .order("meeting_date", { ascending: false })

[Killed] BooleanLiteral
src/lib/supervision.ts:125:41
     .from("notes")
     .select("id, student_id, meeting_date, created_by, updated_by, created_at, updated_at")
     .eq("student_id", studentId)
-    .order("meeting_date", { ascending: false })
+    .order("meeting_date", { ascending: true })
     .order("created_at", { ascending: false })
     .overrideTypes<NoteRow[], { merge: false }>();
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: expected [ 'note-older', …(2) ] to deeply equal [ 'note-same-date-later', …(2) ]

[Killed] ObjectLiteral
src/lib/supervision.ts:125:28
     .from("notes")
     .select("id, student_id, meeting_date, created_by, updated_by, created_at, updated_at")
     .eq("student_id", studentId)
-    .order("meeting_date", { ascending: false })
+    .order("meeting_date", {})
     .order("created_at", { ascending: false })
     .overrideTypes<NoteRow[], { merge: false }>();
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: expected [ 'note-older', …(2) ] to deeply equal [ 'note-same-date-later', …(2) ]

[Killed] BooleanLiteral
src/lib/supervision.ts:126:39
     .select("id, student_id, meeting_date, created_by, updated_by, created_at, updated_at")
     .eq("student_id", studentId)
     .order("meeting_date", { ascending: false })
-    .order("created_at", { ascending: false })
+    .order("created_at", { ascending: true })
     .overrideTypes<NoteRow[], { merge: false }>();
 
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: expected [ 'note-same-date-earlier', …(2) ] to deeply equal [ 'note-same-date-later', …(2) ]

[Killed] BlockStatement
src/lib/supervision.ts:129:19
     .order("created_at", { ascending: false })
     .overrideTypes<NoteRow[], { merge: false }>();
 
-  if (notesError) {
-    throw toError(notesError, "Unable to load note history for this student.");
-  }
+  if (notesError) {}
 
   const notes = notesData;
killedBy: supervision read model continuity surfaces notes lookup errors instead of returning partial history
statusReason: expected [Function] to throw error including 'notes lookup failed | code: 42P01' but got 'Cannot read properties of null (readi…'

[Survived] StringLiteral
src/lib/supervision.ts:130:31
     .overrideTypes<NoteRow[], { merge: false }>();
 
   if (notesError) {
-    throw toError(notesError, "Unable to load note history for this student.");
+    throw toError(notesError, "");
   }
 

[Killed] ArrowFunction
src/lib/supervision.ts:134:29
   }
 
   const notes = notesData;
-  const noteIds = notes.map((note) => note.id);
+  const noteIds = notes.map(() => undefined);
   const items = noteIds.length > 0 ? await loadNoteItems(supabase, noteIds) : [];
 
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] ConditionalExpression
src/lib/supervision.ts:135:17
 
   const notes = notesData;
   const noteIds = notes.map((note) => note.id);
-  const items = noteIds.length > 0 ? await loadNoteItems(supabase, noteIds) : [];
+  const items = false ? await loadNoteItems(supabase, noteIds) : [];
 
   const itemsByNoteId = groupItemsByNoteId(items);
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] EqualityOperator
src/lib/supervision.ts:135:17
 
   const notes = notesData;
   const noteIds = notes.map((note) => note.id);
-  const items = noteIds.length > 0 ? await loadNoteItems(supabase, noteIds) : [];
+  const items = noteIds.length <= 0 ? await loadNoteItems(supabase, noteIds) : [];
 
   const itemsByNoteId = groupItemsByNoteId(items);
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: expected [] to deeply equal [ 1, 2 ]
