[Killed] ArrowFunction
src/lib/supervision.ts:138:53
   const items = noteIds.length > 0 ? await loadNoteItems(supabase, noteIds) : [];
 
   const itemsByNoteId = groupItemsByNoteId(items);
-  const notesWithItems: NoteWithItems[] = notes.map((note) => ({
-    ...note,
-    items: itemsByNoteId.get(note.id) ?? [],
-  }));
+  const notesWithItems: NoteWithItems[] = notes.map(() => undefined);
 
   return {
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
src/lib/supervision.ts:140:12
   const itemsByNoteId = groupItemsByNoteId(items);
   const notesWithItems: NoteWithItems[] = notes.map((note) => ({
     ...note,
-    items: itemsByNoteId.get(note.id) ?? [],
+    items: itemsByNoteId.get(note.id) && [],
   }));
 
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] ArrayDeclaration
src/lib/supervision.ts:140:42
   const itemsByNoteId = groupItemsByNoteId(items);
   const notesWithItems: NoteWithItems[] = notes.map((note) => ({
     ...note,
-    items: itemsByNoteId.get(note.id) ?? [],
+    items: itemsByNoteId.get(note.id) ?? ["Stryker was here"],
   }));
 
killedBy: supervision read model continuity returns an empty item list when a note has no note_items rows
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
src/lib/supervision.ts:152:39
 export async function getLinkedStudentHistoryForUser(
   supabase: SupabaseClient,
   userId: string,
-): Promise<StudentWithHistory | null> {
-  const studentResult = await supabase
-    .from("students")
-    .select("id, professor_profile_id, student_profile_id, full_name, email, created_at, updated_at")
-    .eq("student_profile_id", userId)
-    .maybeSingle<StudentRow>();
-  const studentData = studentResult.data;
-  const studentError = studentResult.error;
-
-  if (studentError) {
-    throw toError(studentError, "Unable to load the linked student record.");
-  }
-
-  const student = studentData;
-  if (!student) {
-    return null;
-  }
-
-  return getStudentHistory(supabase, student.id);
-}
+): Promise<StudentWithHistory | null> {}
 
 async function loadNoteItems(supabase: SupabaseClient, noteIds: string[]): Promise<NoteItemRow[]> {
killedBy: supervision read model continuity returns null when a linked student record cannot be found
statusReason: expected undefined to be null

[Survived] StringLiteral
src/lib/supervision.ts:155:13
 ): Promise<StudentWithHistory | null> {
   const studentResult = await supabase
     .from("students")
-    .select("id, professor_profile_id, student_profile_id, full_name, email, created_at, updated_at")
+    .select("")
     .eq("student_profile_id", userId)
     .maybeSingle<StudentRow>();

[Killed] StringLiteral
src/lib/supervision.ts:156:9
   const studentResult = await supabase
     .from("students")
     .select("id, professor_profile_id, student_profile_id, full_name, email, created_at, updated_at")
-    .eq("student_profile_id", userId)
+    .eq("", userId)
     .maybeSingle<StudentRow>();
   const studentData = studentResult.data;
killedBy: supervision read model continuity loads the linked student's history through the shared read model
statusReason: expected null not to be null

[NoCoverage] BlockStatement
src/lib/supervision.ts:161:21
   const studentData = studentResult.data;
   const studentError = studentResult.error;
 
-  if (studentError) {
-    throw toError(studentError, "Unable to load the linked student record.");
-  }
+  if (studentError) {}
 
   const student = studentData;

[Killed] BlockStatement
src/lib/supervision.ts:173:99
   return getStudentHistory(supabase, student.id);
 }
 
-async function loadNoteItems(supabase: SupabaseClient, noteIds: string[]): Promise<NoteItemRow[]> {
-  // Preserve item ordering at the shared read-model boundary for both dashboard branches and future readers.
-  const noteItemsResult = await supabase
-    .from("note_items")
-    .select("id, note_id, position, item_type, content, completed_at, completed_by, created_at, updated_at")
-    .in("note_id", noteIds)
-    .order("position", { ascending: true });
-  const noteItemsData = noteItemsResult.data;
-  const noteItemsError = noteItemsResult.error;
-
-  if (noteItemsError) {
-    throw toError(noteItemsError, "Unable to load note items for this student.");
-  }
-
-  return noteItemsData ?? [];
-}
+async function loadNoteItems(supabase: SupabaseClient, noteIds: string[]): Promise<NoteItemRow[]> {}
 
 function mapAppendedItems(noteId: string, startingPosition: number, items: AppendNoteItemInput[]) {
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: Cannot read properties of undefined (reading 'map')

[Survived] StringLiteral
src/lib/supervision.ts:177:13
   // Preserve item ordering at the shared read-model boundary for both dashboard branches and future readers.
   const noteItemsResult = await supabase
     .from("note_items")
-    .select("id, note_id, position, item_type, content, completed_at, completed_by, created_at, updated_at")
+    .select("")
     .in("note_id", noteIds)
     .order("position", { ascending: true });

[Killed] BooleanLiteral
src/lib/supervision.ts:179:37
     .from("note_items")
     .select("id, note_id, position, item_type, content, completed_at, completed_by, created_at, updated_at")
     .in("note_id", noteIds)
-    .order("position", { ascending: true });
+    .order("position", { ascending: false });
   const noteItemsData = noteItemsResult.data;
   const noteItemsError = noteItemsResult.error;
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: expected [ 2, 1 ] to deeply equal [ 1, 2 ]

[Killed] StringLiteral
src/lib/supervision.ts:179:12
     .from("note_items")
     .select("id, note_id, position, item_type, content, completed_at, completed_by, created_at, updated_at")
     .in("note_id", noteIds)
-    .order("position", { ascending: true });
+    .order("", { ascending: true });
   const noteItemsData = noteItemsResult.data;
   const noteItemsError = noteItemsResult.error;
killedBy: supervision read model continuity returns notes newest-first and preserves note item ordering and semantics
statusReason: expected [ 2, 1 ] to deeply equal [ 1, 2 ]

[Killed] ConditionalExpression
src/lib/supervision.ts:183:7
   const noteItemsData = noteItemsResult.data;
   const noteItemsError = noteItemsResult.error;
 
-  if (noteItemsError) {
+  if (false) {
     throw toError(noteItemsError, "Unable to load note items for this student.");
   }
killedBy: supervision shared note update contract surfaces note item reload errors before mutating any shared-note items
statusReason: promise resolved "{ id: 'note-1', …(7) }" instead of rejecting

[Killed] ConditionalExpression
src/lib/supervision.ts:183:7
   const noteItemsData = noteItemsResult.data;
   const noteItemsError = noteItemsResult.error;
 
-  if (noteItemsError) {
+  if (true) {
     throw toError(noteItemsError, "Unable to load note items for this student.");
   }
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: Unable to load note items for this student.

[Killed] LogicalOperator
src/lib/supervision.ts:187:10
     throw toError(noteItemsError, "Unable to load note items for this student.");
   }
 
-  return noteItemsData ?? [];
+  return noteItemsData && [];
 }
 
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: The selected note item is not accessible.

[NoCoverage] ArrayDeclaration
src/lib/supervision.ts:187:27
     throw toError(noteItemsError, "Unable to load note items for this student.");
   }
 
-  return noteItemsData ?? [];
+  return noteItemsData ?? ["Stryker was here"];
 }
 

[Killed] BlockStatement
src/lib/supervision.ts:190:99
   return noteItemsData ?? [];
 }
 
-function mapAppendedItems(noteId: string, startingPosition: number, items: AppendNoteItemInput[]) {
-  return items.map((item, index) => ({
-    note_id: noteId,
-    position: startingPosition + index,
-    item_type: item.item_type,
-    content: item.content,
-  }));
-}
+function mapAppendedItems(noteId: string, startingPosition: number, items: AppendNoteItemInput[]) {}
 
 function sortItemsByPosition(items: NoteItemRow[]) {
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ArrowFunction
src/lib/supervision.ts:191:20
 }
 
 function mapAppendedItems(noteId: string, startingPosition: number, items: AppendNoteItemInput[]) {
-  return items.map((item, index) => ({
-    note_id: noteId,
-    position: startingPosition + index,
-    item_type: item.item_type,
-    content: item.content,
-  }));
+  return items.map(() => undefined);
 }
 
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ArithmeticOperator
src/lib/supervision.ts:193:15
 function mapAppendedItems(noteId: string, startingPosition: number, items: AppendNoteItemInput[]) {
   return items.map((item, index) => ({
     note_id: noteId,
-    position: startingPosition + index,
+    position: startingPosition - index,
     item_type: item.item_type,
     content: item.content,
killedBy: supervision shared note update contract appends new shared-note items after the highest existing position even when earlier positions are sparse
statusReason: expected [ 2, 5, 5, 6 ] to deeply equal [ 2, 5, 6, 7 ]

[Killed] BlockStatement
src/lib/supervision.ts:199:52
   }));
 }
 
-function sortItemsByPosition(items: NoteItemRow[]) {
-  return [...items].sort((left, right) => left.position - right.position);
-}
+function sortItemsByPosition(items: NoteItemRow[]) {}
 
 export async function createStudentNote(supabase: SupabaseClient, input: CreateNoteInput) {
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/lib/supervision.ts:200:26
 }
 
 function sortItemsByPosition(items: NoteItemRow[]) {
-  return [...items].sort((left, right) => left.position - right.position);
+  return [...items].sort(() => undefined);
 }
 
killedBy: supervision shared note update contract returns note items sorted by position even when the reload order is unstable
statusReason: expected [ 'item-2', 'item-1' ] to deeply equal [ 'item-1', 'item-2' ]

[Killed] MethodExpression
src/lib/supervision.ts:200:10
 }
 
 function sortItemsByPosition(items: NoteItemRow[]) {
-  return [...items].sort((left, right) => left.position - right.position);
+  return [...items];
 }
 
killedBy: supervision shared note update contract returns note items sorted by position even when the reload order is unstable
statusReason: expected [ 'item-2', 'item-1' ] to deeply equal [ 'item-1', 'item-2' ]

[NoCoverage] StringLiteral
src/lib/supervision.ts:206:11
 export async function createStudentNote(supabase: SupabaseClient, input: CreateNoteInput) {
   const { items, ...noteInput } = input;
   const noteResult = await supabase
-    .from("notes")
+    .from("")
     .insert(noteInput)
     .select("id, student_id, meeting_date, created_by, updated_by, created_at, updated_at")

[NoCoverage] ConditionalExpression
src/lib/supervision.ts:213:7
   const noteData = noteResult.data;
   const noteError = noteResult.error;
 
-  if (noteError) {
+  if (false) {
     throw toError(noteError, "Unable to create the note row.");
   }

[NoCoverage] ConditionalExpression
src/lib/supervision.ts:213:7
   const noteData = noteResult.data;
   const noteError = noteResult.error;
 
-  if (noteError) {
+  if (true) {
     throw toError(noteError, "Unable to create the note row.");
   }

[NoCoverage] BooleanLiteral
src/lib/supervision.ts:217:7
     throw toError(noteError, "Unable to create the note row.");
   }
 
-  if (!noteData) {
+  if (noteData) {
     throw new Error("Expected note creation to return a row");
   }

[NoCoverage] ConditionalExpression
src/lib/supervision.ts:217:7
     throw toError(noteError, "Unable to create the note row.");
   }
 
-  if (!noteData) {
+  if (false) {
     throw new Error("Expected note creation to return a row");
   }

[NoCoverage] BlockStatement
src/lib/supervision.ts:222:27
   }
 
   const note: NoteRow = noteData;
-  if (items.length === 0) {
-    return {
-      ...note,
-      items: [],
-    } satisfies NoteWithItems;
-  }
+  if (items.length === 0) {}
 
   const noteItemsInput = items.map((item, index) => ({

[NoCoverage] ConditionalExpression
src/lib/supervision.ts:222:7
   }
 
   const note: NoteRow = noteData;
-  if (items.length === 0) {
+  if (false) {
     return {
       ...note,

[NoCoverage] ArrowFunction
src/lib/supervision.ts:229:36
     } satisfies NoteWithItems;
   }
 
-  const noteItemsInput = items.map((item, index) => ({
-    note_id: note.id,
-    position: index + 1,
-    item_type: item.item_type,
-    content: item.content,
-  }));
+  const noteItemsInput = items.map(() => undefined);
 
   const noteItemsResult = await supabase

[NoCoverage] ArithmeticOperator
src/lib/supervision.ts:231:15
 
   const noteItemsInput = items.map((item, index) => ({
     note_id: note.id,
-    position: index + 1,
+    position: index - 1,
     item_type: item.item_type,
     content: item.content,

[NoCoverage] StringLiteral
src/lib/supervision.ts:244:35
   const noteItemsError = noteItemsResult.error;
 
   if (noteItemsError) {
-    throw toError(noteItemsError, "Unable to create note items for this note.");
+    throw toError(noteItemsError, "");
   }
 

[NoCoverage] LogicalOperator
src/lib/supervision.ts:249:32
 
   return {
     ...note,
-    items: sortItemsByPosition(noteItemsData ?? []),
+    items: sortItemsByPosition(noteItemsData && []),
   } satisfies NoteWithItems;
 }

[Killed] StringLiteral
src/lib/supervision.ts:255:11
 
 export async function updateStudentNote(supabase: SupabaseClient, input: UpdateNoteInput): Promise<NoteWithItems> {
   const { data: existingNote, error: noteLookupError } = await supabase
-    .from("notes")
+    .from("")
     .select("id, student_id, meeting_date, created_by, updated_by, created_at, updated_at")
     .eq("id", input.note_id)
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: The selected note is not accessible.

[Killed] StringLiteral
src/lib/supervision.ts:257:9
   const { data: existingNote, error: noteLookupError } = await supabase
     .from("notes")
     .select("id, student_id, meeting_date, created_by, updated_by, created_at, updated_at")
-    .eq("id", input.note_id)
+    .eq("", input.note_id)
     .eq("student_id", input.student_id)
     .maybeSingle<NoteRow>();
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: The selected note is not accessible.

[Killed] BlockStatement
src/lib/supervision.ts:261:24
     .eq("student_id", input.student_id)
     .maybeSingle<NoteRow>();
 
-  if (noteLookupError) {
-    throw toError(noteLookupError, "Unable to load the existing note.");
-  }
+  if (noteLookupError) {}
 
   if (!existingNote) {
killedBy: supervision shared note update contract surfaces note lookup errors before any shared-note mutation starts
statusReason: expected [Function] to throw error including 'note lookup failed | code: 42501' but got 'The selected note is not accessible.'

[Killed] ConditionalExpression
src/lib/supervision.ts:261:7
     .eq("student_id", input.student_id)
     .maybeSingle<NoteRow>();
 
-  if (noteLookupError) {
+  if (true) {
     throw toError(noteLookupError, "Unable to load the existing note.");
   }
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: Unable to load the existing note.

[Killed] ConditionalExpression
src/lib/supervision.ts:265:7
     throw toError(noteLookupError, "Unable to load the existing note.");
   }
 
-  if (!existingNote) {
+  if (true) {
     throw new Error("The selected note is not accessible.");
   }
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: The selected note is not accessible.

[Killed] BlockStatement
src/lib/supervision.ts:265:22
     throw toError(noteLookupError, "Unable to load the existing note.");
   }
 
-  if (!existingNote) {
-    throw new Error("The selected note is not accessible.");
-  }
+  if (!existingNote) {}
 
   if (existingNote.meeting_date !== input.meeting_date) {
killedBy: supervision shared note update contract rejects updates for a note that is outside the current student scope
statusReason: expected [Function] to throw error including 'The selected note is not accessible.' but got 'Cannot read properties of null (readi…'

[Killed] StringLiteral
src/lib/supervision.ts:266:21
   }
 
   if (!existingNote) {
-    throw new Error("The selected note is not accessible.");
+    throw new Error("");
   }
 
killedBy: supervision shared note update contract rejects updates for a note that is outside the current student scope
statusReason: expected [Function] to throw error including 'The selected note is not accessible.' but got ''

[Killed] EqualityOperator
src/lib/supervision.ts:269:7
     throw new Error("The selected note is not accessible.");
   }
 
-  if (existingNote.meeting_date !== input.meeting_date) {
+  if (existingNote.meeting_date === input.meeting_date) {
     throw new Error("Meeting date cannot be changed for an existing note.");
   }
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: Meeting date cannot be changed for an existing note.

[Killed] BlockStatement
src/lib/supervision.ts:269:57
     throw new Error("The selected note is not accessible.");
   }
 
-  if (existingNote.meeting_date !== input.meeting_date) {
-    throw new Error("Meeting date cannot be changed for an existing note.");
-  }
+  if (existingNote.meeting_date !== input.meeting_date) {}
 
   if (existingNote.created_by !== input.created_by) {
killedBy: supervision shared note update contract rejects immutable field drift before mutating the note
statusReason: promise resolved "{ id: 'note-1', …(7) }" instead of rejecting

[Killed] EqualityOperator
src/lib/supervision.ts:273:7
     throw new Error("Meeting date cannot be changed for an existing note.");
   }
 
-  if (existingNote.created_by !== input.created_by) {
+  if (existingNote.created_by === input.created_by) {
     throw new Error("Note ownership cannot be changed for an existing note.");
   }
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: Note ownership cannot be changed for an existing note.

[Killed] ConditionalExpression
src/lib/supervision.ts:273:7
     throw new Error("Meeting date cannot be changed for an existing note.");
   }
 
-  if (existingNote.created_by !== input.created_by) {
+  if (true) {
     throw new Error("Note ownership cannot be changed for an existing note.");
   }
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: Note ownership cannot be changed for an existing note.

[Killed] ArrayDeclaration
src/lib/supervision.ts:277:54
     throw new Error("Note ownership cannot be changed for an existing note.");
   }
 
-  const currentItems = await loadNoteItems(supabase, [input.note_id]);
+  const currentItems = await loadNoteItems(supabase, []);
   const currentItemsById = new Map(currentItems.map((item) => [item.id, item]));
 
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: The selected note item is not accessible.

[Killed] ArrowFunction
src/lib/supervision.ts:278:53
   }
 
   const currentItems = await loadNoteItems(supabase, [input.note_id]);
-  const currentItemsById = new Map(currentItems.map((item) => [item.id, item]));
+  const currentItemsById = new Map(currentItems.map(() => undefined));
 
   for (const item of input.existing_items) {
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: Iterator value undefined is not an entry object

[Killed] ArrayDeclaration
src/lib/supervision.ts:278:63
   }
 
   const currentItems = await loadNoteItems(supabase, [input.note_id]);
-  const currentItemsById = new Map(currentItems.map((item) => [item.id, item]));
+  const currentItemsById = new Map(currentItems.map((item) => []));
 
   for (const item of input.existing_items) {
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: The selected note item is not accessible.

[Killed] BlockStatement
src/lib/supervision.ts:280:44
   const currentItems = await loadNoteItems(supabase, [input.note_id]);
   const currentItemsById = new Map(currentItems.map((item) => [item.id, item]));
 
-  for (const item of input.existing_items) {
-    if (!currentItemsById.has(item.id)) {
-      throw new Error("The selected note item is not accessible.");
-    }
-  }
+  for (const item of input.existing_items) {}
 
   const noteUpdateResult = await supabase
killedBy: supervision shared note update contract rejects a mixed update when any existing item id does not belong to the current note
statusReason: expected [ { table: 'notes', …(2) }, …(14) ] to not deep equally contain ObjectContaining{…}

[Killed] BlockStatement
src/lib/supervision.ts:281:41
   const currentItemsById = new Map(currentItems.map((item) => [item.id, item]));
 
   for (const item of input.existing_items) {
-    if (!currentItemsById.has(item.id)) {
-      throw new Error("The selected note item is not accessible.");
-    }
+    if (!currentItemsById.has(item.id)) {}
   }
 
killedBy: supervision shared note update contract rejects a mixed update when any existing item id does not belong to the current note
statusReason: expected [ { table: 'notes', …(2) }, …(14) ] to not deep equally contain ObjectContaining{…}

[Killed] ConditionalExpression
src/lib/supervision.ts:281:9
   const currentItemsById = new Map(currentItems.map((item) => [item.id, item]));
 
   for (const item of input.existing_items) {
-    if (!currentItemsById.has(item.id)) {
+    if (true) {
       throw new Error("The selected note item is not accessible.");
     }
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: The selected note item is not accessible.

[Killed] StringLiteral
src/lib/supervision.ts:287:11
   }
 
   const noteUpdateResult = await supabase
-    .from("notes")
+    .from("")
     .update({
       updated_by: input.updated_by,
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: Cannot read properties of undefined (reading 'update')

[Killed] ObjectLiteral
src/lib/supervision.ts:288:13
 
   const noteUpdateResult = await supabase
     .from("notes")
-    .update({
-      updated_by: input.updated_by,
-    })
+    .update({})
     .eq("id", input.note_id)
     .eq("student_id", input.student_id)
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: expected 'prof-1' to be 'student-1' // Object.is equality

[Killed] StringLiteral
src/lib/supervision.ts:292:9
       updated_by: input.updated_by,
     })
     .eq("id", input.note_id)
-    .eq("student_id", input.student_id)
+    .eq("", input.student_id)
     .select("id, student_id, meeting_date, created_by, updated_by, created_at, updated_at")
     .single();
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: Expected note update to return a row

[Killed] BlockStatement
src/lib/supervision.ts:298:24
   const updatedNoteData = noteUpdateResult.data;
   const noteUpdateError = noteUpdateResult.error;
 
-  if (noteUpdateError) {
-    throw toError(noteUpdateError, "Unable to update the note.");
-  }
+  if (noteUpdateError) {}
 
   if (!updatedNoteData) {
killedBy: supervision shared note update contract surfaces note update persistence errors instead of continuing with a partial shared-note edit
statusReason: expected [Function] to throw error including 'note update failed | code: 42501' but got 'Expected note update to return a row'

[Killed] ConditionalExpression
src/lib/supervision.ts:298:7
   const updatedNoteData = noteUpdateResult.data;
   const noteUpdateError = noteUpdateResult.error;
 
-  if (noteUpdateError) {
+  if (false) {
     throw toError(noteUpdateError, "Unable to update the note.");
   }
killedBy: supervision shared note update contract surfaces note update persistence errors instead of continuing with a partial shared-note edit
statusReason: expected [Function] to throw error including 'note update failed | code: 42501' but got 'Expected note update to return a row'

[Killed] BooleanLiteral
src/lib/supervision.ts:302:7
     throw toError(noteUpdateError, "Unable to update the note.");
   }
 
-  if (!updatedNoteData) {
+  if (updatedNoteData) {
     throw new Error("Expected note update to return a row");
   }
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: Expected note update to return a row

[Killed] ConditionalExpression
src/lib/supervision.ts:302:7
     throw toError(noteUpdateError, "Unable to update the note.");
   }
 
-  if (!updatedNoteData) {
+  if (true) {
     throw new Error("Expected note update to return a row");
   }
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: Expected note update to return a row

[Killed] BlockStatement
src/lib/supervision.ts:306:44
     throw new Error("Expected note update to return a row");
   }
 
-  for (const item of input.existing_items) {
-    const currentItem = currentItemsById.get(item.id);
-    if (!currentItem) {
-      throw new Error("The selected note item is not accessible.");
-    }
-
-    const { error: itemUpdateError } = await supabase
-      .from("note_items")
-      .update({
-        item_type: item.item_type,
-        content: item.content,
-      })
-      .eq("id", item.id)
-      .eq("note_id", input.note_id);
-
-    if (itemUpdateError) {
-      throw toError(itemUpdateError, "Unable to update one of the existing note items.");
-    }
-  }
+  for (const item of input.existing_items) {}
 
   if (input.new_items.length > 0) {
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: expected { id: 'item-1', …(8) } to match object { id: 'item-1', …(2) }
(6 matching properties omitted from actual)

[Killed] ConditionalExpression
src/lib/supervision.ts:308:9
 
   for (const item of input.existing_items) {
     const currentItem = currentItemsById.get(item.id);
-    if (!currentItem) {
+    if (true) {
       throw new Error("The selected note item is not accessible.");
     }
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: The selected note item is not accessible.

[Killed] BooleanLiteral
src/lib/supervision.ts:308:9
 
   for (const item of input.existing_items) {
     const currentItem = currentItemsById.get(item.id);
-    if (!currentItem) {
+    if (currentItem) {
       throw new Error("The selected note item is not accessible.");
     }
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: The selected note item is not accessible.

[NoCoverage] StringLiteral
src/lib/supervision.ts:309:23
   for (const item of input.existing_items) {
     const currentItem = currentItemsById.get(item.id);
     if (!currentItem) {
-      throw new Error("The selected note item is not accessible.");
+      throw new Error("");
     }
 
