[Killed] ObjectLiteral
src/lib/supervision.ts:314:15
 
     const { error: itemUpdateError } = await supabase
       .from("note_items")
-      .update({
-        item_type: item.item_type,
-        content: item.content,
-      })
+      .update({})
       .eq("id", item.id)
       .eq("note_id", input.note_id);
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: expected { id: 'item-1', …(8) } to match object { id: 'item-1', …(2) }
(6 matching properties omitted from actual)

[Killed] ConditionalExpression
src/lib/supervision.ts:321:9
       .eq("id", item.id)
       .eq("note_id", input.note_id);
 
-    if (itemUpdateError) {
+    if (false) {
       throw toError(itemUpdateError, "Unable to update one of the existing note items.");
     }
killedBy: supervision shared note update contract surfaces note item update errors instead of silently accepting a broken shared-note edit
statusReason: promise resolved "{ id: 'note-1', …(7) }" instead of rejecting

[Killed] ConditionalExpression
src/lib/supervision.ts:321:9
       .eq("id", item.id)
       .eq("note_id", input.note_id);
 
-    if (itemUpdateError) {
+    if (true) {
       throw toError(itemUpdateError, "Unable to update one of the existing note items.");
     }
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: Unable to update one of the existing note items.

[Killed] EqualityOperator
src/lib/supervision.ts:326:7
     }
   }
 
-  if (input.new_items.length > 0) {
+  if (input.new_items.length >= 0) {
     const maxPosition = currentItems.reduce((highestPosition, item) => Math.max(highestPosition, item.position), 0);
     const noteItemsResult = await supabase
killedBy: supervision shared note update contract updates existing items in place without appending when new_items is empty
statusReason: expected [ { table: 'note_items', …(2) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/lib/supervision.ts:326:7
     }
   }
 
-  if (input.new_items.length > 0) {
+  if (false) {
     const maxPosition = currentItems.reduce((highestPosition, item) => Math.max(highestPosition, item.position), 0);
     const noteItemsResult = await supabase
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: expected [ 'item-1', 'item-2' ] to deeply equal [ 'item-1', 'item-2', 'stub-row-1' ]

[Killed] ArrowFunction
src/lib/supervision.ts:327:45
   }
 
   if (input.new_items.length > 0) {
-    const maxPosition = currentItems.reduce((highestPosition, item) => Math.max(highestPosition, item.position), 0);
+    const maxPosition = currentItems.reduce(() => undefined, 0);
     const noteItemsResult = await supabase
       .from("note_items")
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: expected [ 1, 2, NaN ] to deeply equal [ 1, 2, 3 ]

[Killed] MethodExpression
src/lib/supervision.ts:327:72
   }
 
   if (input.new_items.length > 0) {
-    const maxPosition = currentItems.reduce((highestPosition, item) => Math.max(highestPosition, item.position), 0);
+    const maxPosition = currentItems.reduce((highestPosition, item) => Math.min(highestPosition, item.position), 0);
     const noteItemsResult = await supabase
       .from("note_items")
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: expected [ 'item-1', 'stub-row-1', 'item-2' ] to deeply equal [ 'item-1', 'item-2', 'stub-row-1' ]

[Killed] ArithmeticOperator
src/lib/supervision.ts:330:47
     const maxPosition = currentItems.reduce((highestPosition, item) => Math.max(highestPosition, item.position), 0);
     const noteItemsResult = await supabase
       .from("note_items")
-      .insert(mapAppendedItems(input.note_id, maxPosition + 1, input.new_items))
+      .insert(mapAppendedItems(input.note_id, maxPosition - 1, input.new_items))
       .select("id, note_id, position, item_type, content, completed_at, completed_by, created_at, updated_at");
     const noteItemsError = noteItemsResult.error;
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: expected [ 'item-1', 'stub-row-1', 'item-2' ] to deeply equal [ 'item-1', 'item-2', 'stub-row-1' ]

[Killed] BlockStatement
src/lib/supervision.ts:334:25
       .select("id, note_id, position, item_type, content, completed_at, completed_by, created_at, updated_at");
     const noteItemsError = noteItemsResult.error;
 
-    if (noteItemsError) {
-      throw toError(noteItemsError, "Unable to append new note items.");
-    }
+    if (noteItemsError) {}
   }
 
killedBy: supervision shared note update contract surfaces append errors instead of returning a partially grown shared note
statusReason: promise resolved "{ id: 'note-1', …(7) }" instead of rejecting

[Survived] StringLiteral
src/lib/supervision.ts:335:37
     const noteItemsError = noteItemsResult.error;
 
     if (noteItemsError) {
-      throw toError(noteItemsError, "Unable to append new note items.");
+      throw toError(noteItemsError, "");
     }
   }

[Killed] ArrayDeclaration
src/lib/supervision.ts:339:53
     }
   }
 
-  const latestItems = await loadNoteItems(supabase, [input.note_id]);
+  const latestItems = await loadNoteItems(supabase, []);
 
   return {
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: expected [] to deeply equal [ 'item-1', 'item-2', 'stub-row-1' ]

[Killed] ObjectLiteral
src/lib/supervision.ts:341:10
 
   const latestItems = await loadNoteItems(supabase, [input.note_id]);
 
-  return {
-    ...updatedNoteData,
-    items: sortItemsByPosition(latestItems),
-  } satisfies NoteWithItems;
+  return {} satisfies NoteWithItems;
 }
 
killedBy: supervision shared note update contract preserves existing item ids, appends new items at the tail, and updates note continuity metadata
statusReason: expected undefined to be 'student-1' // Object.is equality

[Killed] StringLiteral
src/lib/supervision.ts:349:11
 
 export async function setTaskCompletion(supabase: SupabaseClient, input: SetTaskCompletionInput): Promise<NoteItemRow> {
   const { data: existingItem, error: itemLookupError } = await supabase
-    .from("note_items")
+    .from("")
     .select("id, note_id, position, item_type, content, completed_at, completed_by, created_at, updated_at")
     .eq("id", input.note_item_id)
killedBy: task completion contract completes and reopens a durable task item without changing its identity or position
statusReason: The selected note item is not accessible.

[Killed] StringLiteral
src/lib/supervision.ts:351:9
   const { data: existingItem, error: itemLookupError } = await supabase
     .from("note_items")
     .select("id, note_id, position, item_type, content, completed_at, completed_by, created_at, updated_at")
-    .eq("id", input.note_item_id)
+    .eq("", input.note_item_id)
     .eq("note_id", input.note_id)
     .maybeSingle<NoteItemRow>();
killedBy: task completion contract completes and reopens a durable task item without changing its identity or position
statusReason: The selected note item is not accessible.

[Killed] ConditionalExpression
src/lib/supervision.ts:355:7
     .eq("note_id", input.note_id)
     .maybeSingle<NoteItemRow>();
 
-  if (itemLookupError) {
+  if (true) {
     throw toError(itemLookupError, "Unable to load the selected note item.");
   }
killedBy: task completion contract completes and reopens a durable task item without changing its identity or position
statusReason: Unable to load the selected note item.

[NoCoverage] BlockStatement
src/lib/supervision.ts:355:24
     .eq("note_id", input.note_id)
     .maybeSingle<NoteItemRow>();
 
-  if (itemLookupError) {
-    throw toError(itemLookupError, "Unable to load the selected note item.");
-  }
+  if (itemLookupError) {}
 
   if (!existingItem) {

[Killed] ConditionalExpression
src/lib/supervision.ts:359:7
     throw toError(itemLookupError, "Unable to load the selected note item.");
   }
 
-  if (!existingItem) {
+  if (false) {
     throw new Error("The selected note item is not accessible.");
   }
killedBy: task completion contract rejects completion attempts for inaccessible note items
statusReason: expected [Function] to throw error including 'The selected note item is not accessi…' but got 'Cannot read properties of null (readi…'

[Killed] BooleanLiteral
src/lib/supervision.ts:359:7
     throw toError(itemLookupError, "Unable to load the selected note item.");
   }
 
-  if (!existingItem) {
+  if (existingItem) {
     throw new Error("The selected note item is not accessible.");
   }
killedBy: task completion contract completes and reopens a durable task item without changing its identity or position
statusReason: The selected note item is not accessible.

[Killed] EqualityOperator
src/lib/supervision.ts:363:7
     throw new Error("The selected note item is not accessible.");
   }
 
-  if (existingItem.item_type !== "task") {
+  if (existingItem.item_type === "task") {
     throw new Error("Only task items can change completion state.");
   }
killedBy: task completion contract completes and reopens a durable task item without changing its identity or position
statusReason: Only task items can change completion state.

[Killed] ConditionalExpression
src/lib/supervision.ts:363:7
     throw new Error("The selected note item is not accessible.");
   }
 
-  if (existingItem.item_type !== "task") {
+  if (false) {
     throw new Error("Only task items can change completion state.");
   }
killedBy: task completion contract rejects completion attempts for info items
statusReason: promise resolved "{ id: 'info-1', …(8) }" instead of rejecting

[Killed] ConditionalExpression
src/lib/supervision.ts:368:5
   }
 
   const completionPatch =
-    input.state === "complete"
+    false
       ? {
           completed_at: new Date().toISOString(),
killedBy: task completion contract completes and reopens a durable task item without changing its identity or position
statusReason: expected null to be 'student-1' // Object.is equality

[Killed] ConditionalExpression
src/lib/supervision.ts:368:5
   }
 
   const completionPatch =
-    input.state === "complete"
+    true
       ? {
           completed_at: new Date().toISOString(),
killedBy: task completion contract completes and reopens a durable task item without changing its identity or position
statusReason: expected '2026-06-08T19:31:06.970Z' to be null

[Killed] ObjectLiteral
src/lib/supervision.ts:373:9
           completed_at: new Date().toISOString(),
           completed_by: input.completed_by,
         }
-      : {
-          completed_at: null,
-          completed_by: null,
-        };
+      : {};
 
   const { data: updatedItem, error: itemUpdateError } = await supabase
killedBy: task completion contract completes and reopens a durable task item without changing its identity or position
statusReason: expected '2026-06-08T19:31:07.207Z' to be null

[Killed] StringLiteral
src/lib/supervision.ts:379:11
         };
 
   const { data: updatedItem, error: itemUpdateError } = await supabase
-    .from("note_items")
+    .from("")
     .update(completionPatch)
     .eq("id", input.note_item_id)
killedBy: task completion contract completes and reopens a durable task item without changing its identity or position
statusReason: Cannot read properties of undefined (reading 'update')

[Killed] StringLiteral
src/lib/supervision.ts:382:9
     .from("note_items")
     .update(completionPatch)
     .eq("id", input.note_item_id)
-    .eq("note_id", input.note_id)
+    .eq("", input.note_id)
     .select("id, note_id, position, item_type, content, completed_at, completed_by, created_at, updated_at")
     .single<NoteItemRow>();
killedBy: task completion contract completes and reopens a durable task item without changing its identity or position
statusReason: Cannot read properties of null (reading 'id')

[Survived] StringLiteral
src/lib/supervision.ts:383:13
     .update(completionPatch)
     .eq("id", input.note_item_id)
     .eq("note_id", input.note_id)
-    .select("id, note_id, position, item_type, content, completed_at, completed_by, created_at, updated_at")
+    .select("")
     .single<NoteItemRow>();
 

[NoCoverage] StringLiteral
src/lib/supervision.ts:387:36
     .single<NoteItemRow>();
 
   if (itemUpdateError) {
-    throw toError(itemUpdateError, "Unable to update task completion state.");
+    throw toError(itemUpdateError, "");
   }
 

[NoCoverage] BlockStatement
src/lib/supervision.ts:393:120
   return updatedItem;
 }
 
-export async function createProfessorStudent(supabase: SupabaseClient, input: CreateStudentInput): Promise<StudentRow> {
-  const studentResult = await supabase
-    .from("students")
-    .insert(input)
-    .select("id, professor_profile_id, student_profile_id, full_name, email, created_at, updated_at")
-    .single();
-  const studentData = studentResult.data;
-  const studentError = studentResult.error;
-
-  if (studentError) {
-    throw toError(studentError, "Unable to create the student record.");
-  }
-
-  if (!studentData) {
-    throw new Error("Expected student creation to return a row");
-  }
-
-  return studentData satisfies StudentRow;
-}
+export async function createProfessorStudent(supabase: SupabaseClient, input: CreateStudentInput): Promise<StudentRow> {}
 
 export async function claimStudentLink(

[NoCoverage] BlockStatement
src/lib/supervision.ts:402:21
   const studentData = studentResult.data;
   const studentError = studentResult.error;
 
-  if (studentError) {
-    throw toError(studentError, "Unable to create the student record.");
-  }
+  if (studentError) {}
 
   if (!studentData) {

[NoCoverage] BooleanLiteral
src/lib/supervision.ts:406:7
     throw toError(studentError, "Unable to create the student record.");
   }
 
-  if (!studentData) {
+  if (studentData) {
     throw new Error("Expected student creation to return a row");
   }

[NoCoverage] BlockStatement
src/lib/supervision.ts:406:21
     throw toError(studentError, "Unable to create the student record.");
   }
 
-  if (!studentData) {
-    throw new Error("Expected student creation to return a row");
-  }
+  if (!studentData) {}
 
   return studentData satisfies StudentRow;

[Killed] MethodExpression
src/lib/supervision.ts:417:27
   supabase: SupabaseClient,
   input: ClaimStudentLinkInput,
 ): Promise<ClaimStudentLinkResult> {
-  const normalizedEmail = input.email.trim().toLowerCase();
+  const normalizedEmail = input.email.trim().toUpperCase();
   if (!normalizedEmail) {
     return {
killedBy: professor roster link status shows a claimed student as linked in the professor roster after the claim mutation succeeds
statusReason: expected { status: 'missing-match', …(1) } to deeply equal { status: 'claimable', …(1) }

[Survived] MethodExpression
src/lib/supervision.ts:417:27
   supabase: SupabaseClient,
   input: ClaimStudentLinkInput,
 ): Promise<ClaimStudentLinkResult> {
-  const normalizedEmail = input.email.trim().toLowerCase();
+  const normalizedEmail = input.email.toLowerCase();
   if (!normalizedEmail) {
     return {

[Killed] BooleanLiteral
src/lib/supervision.ts:418:7
   input: ClaimStudentLinkInput,
 ): Promise<ClaimStudentLinkResult> {
   const normalizedEmail = input.email.trim().toLowerCase();
-  if (!normalizedEmail) {
+  if (normalizedEmail) {
     return {
       status: "missing-email",
killedBy: professor roster link status shows a claimed student as linked in the professor roster after the claim mutation succeeds
statusReason: expected { status: 'missing-email', …(1) } to deeply equal { status: 'claimable', …(1) }

[Killed] ConditionalExpression
src/lib/supervision.ts:418:7
   input: ClaimStudentLinkInput,
 ): Promise<ClaimStudentLinkResult> {
   const normalizedEmail = input.email.trim().toLowerCase();
-  if (!normalizedEmail) {
+  if (true) {
     return {
       status: "missing-email",
killedBy: student account linking contract links only the intended row by setting student_profile_id when one match exists
statusReason: expected { status: 'missing-email', …(1) } to deeply equal { status: 'claimable', …(1) }

[Survived] StringLiteral
src/lib/supervision.ts:427:13
 
   const { data: existingLink, error: existingLinkError } = await supabase
     .from("students")
-    .select("id")
+    .select("")
     .eq("student_profile_id", input.user_id)
     .maybeSingle<{ id: string }>();

[Killed] ConditionalExpression
src/lib/supervision.ts:431:7
     .eq("student_profile_id", input.user_id)
     .maybeSingle<{ id: string }>();
 
-  if (existingLinkError) {
+  if (true) {
     throw toError(existingLinkError, "Unable to verify existing student access.");
   }
killedBy: student account linking contract links only the intended row by setting student_profile_id when one match exists
statusReason: Unable to verify existing student access.

[Survived] ConditionalExpression
src/lib/supervision.ts:431:7
     .eq("student_profile_id", input.user_id)
     .maybeSingle<{ id: string }>();
 
-  if (existingLinkError) {
+  if (false) {
     throw toError(existingLinkError, "Unable to verify existing student access.");
   }

[NoCoverage] StringLiteral
src/lib/supervision.ts:432:38
     .maybeSingle<{ id: string }>();
 
   if (existingLinkError) {
-    throw toError(existingLinkError, "Unable to verify existing student access.");
+    throw toError(existingLinkError, "");
   }
 

[Killed] BlockStatement
src/lib/supervision.ts:435:21
     throw toError(existingLinkError, "Unable to verify existing student access.");
   }
 
-  if (existingLink) {
-    return {
-      status: "already-linked",
-      linked_student_id: existingLink.id,
-    };
-  }
+  if (existingLink) {}
 
   const { data: matches, error: matchesError } = await supabase
killedBy: student account linking contract refuses to relink when the user already has a linked student row
statusReason: expected { status: 'claimable', …(1) } to deeply equal { status: 'already-linked', …(1) }

[Killed] ConditionalExpression
src/lib/supervision.ts:435:7
     throw toError(existingLinkError, "Unable to verify existing student access.");
   }
 
-  if (existingLink) {
+  if (false) {
     return {
       status: "already-linked",
killedBy: student account linking contract refuses to relink when the user already has a linked student row
statusReason: expected { status: 'claimable', …(1) } to deeply equal { status: 'already-linked', …(1) }

[Killed] ObjectLiteral
src/lib/supervision.ts:436:12
   }
 
   if (existingLink) {
-    return {
-      status: "already-linked",
-      linked_student_id: existingLink.id,
-    };
+    return {};
   }
 
killedBy: student account linking contract refuses to relink when the user already has a linked student row
statusReason: expected {} to deeply equal { status: 'already-linked', …(1) }

[Killed] StringLiteral
src/lib/supervision.ts:445:9
   const { data: matches, error: matchesError } = await supabase
     .from("students")
     .select("id, student_profile_id")
-    .eq("email", normalizedEmail)
+    .eq("", normalizedEmail)
     .is("student_profile_id", null)
     .overrideTypes<Pick<StudentRow, "id" | "student_profile_id">[], { merge: false }>();
killedBy: student account linking contract links only the intended row by setting student_profile_id when one match exists
statusReason: expected { status: 'missing-match', …(1) } to deeply equal { status: 'claimable', …(1) }

[Killed] ConditionalExpression
src/lib/supervision.ts:449:7
     .is("student_profile_id", null)
     .overrideTypes<Pick<StudentRow, "id" | "student_profile_id">[], { merge: false }>();
 
-  if (matchesError) {
+  if (true) {
     throw toError(matchesError, "Unable to verify claimable student access.");
   }
killedBy: student account linking contract links only the intended row by setting student_profile_id when one match exists
statusReason: Unable to verify claimable student access.

[Survived] ConditionalExpression
src/lib/supervision.ts:449:7
     .is("student_profile_id", null)
     .overrideTypes<Pick<StudentRow, "id" | "student_profile_id">[], { merge: false }>();
 
-  if (matchesError) {
+  if (false) {
     throw toError(matchesError, "Unable to verify claimable student access.");
   }

[Killed] ConditionalExpression
src/lib/supervision.ts:453:7
     throw toError(matchesError, "Unable to verify claimable student access.");
   }
 
-  if (matches.length === 0) {
+  if (true) {
     return {
       status: "missing-match",
killedBy: student account linking contract links only the intended row by setting student_profile_id when one match exists
statusReason: expected { status: 'missing-match', …(1) } to deeply equal { status: 'claimable', …(1) }

[Killed] EqualityOperator
src/lib/supervision.ts:453:7
     throw toError(matchesError, "Unable to verify claimable student access.");
   }
 
-  if (matches.length === 0) {
+  if (matches.length !== 0) {
     return {
       status: "missing-match",
killedBy: student account linking contract links only the intended row by setting student_profile_id when one match exists
statusReason: expected { status: 'missing-match', …(1) } to deeply equal { status: 'claimable', …(1) }

[NoCoverage] StringLiteral
src/lib/supervision.ts:455:15
 
   if (matches.length === 0) {
     return {
-      status: "missing-match",
+      status: "",
       linked_student_id: null,
     };

[Killed] ConditionalExpression
src/lib/supervision.ts:460:7
     };
   }
 
-  if (matches.length > 1) {
+  if (false) {
     return {
       status: "ambiguous-match",
killedBy: student account linking contract does not partially link any student row when duplicate matches block the claim
statusReason: expected { status: 'claimable', …(1) } to deeply equal { status: 'ambiguous-match', …(1) }

[Killed] ConditionalExpression
src/lib/supervision.ts:460:7
     };
   }
 
-  if (matches.length > 1) {
+  if (true) {
     return {
       status: "ambiguous-match",
killedBy: student account linking contract links only the intended row by setting student_profile_id when one match exists
statusReason: expected { status: 'ambiguous-match', …(1) } to deeply equal { status: 'claimable', …(1) }

[Killed] StringLiteral
src/lib/supervision.ts:462:15
 
   if (matches.length > 1) {
     return {
-      status: "ambiguous-match",
+      status: "",
       linked_student_id: null,
     };
killedBy: student account linking contract does not partially link any student row when duplicate matches block the claim
statusReason: expected { status: '', linked_student_id: null } to deeply equal { status: 'ambiguous-match', …(1) }

[Killed] ObjectLiteral
src/lib/supervision.ts:470:13
   const [match] = matches;
   const { data: updatedStudent, error: updateError } = await supabase
     .from("students")
-    .update({ student_profile_id: input.user_id })
+    .update({})
     .eq("id", match.id)
     .is("student_profile_id", null)
killedBy: student account linking contract links only the intended row by setting student_profile_id when one match exists
statusReason: expected [ { id: 'student-1', …(6) }, …(1) ] to deeply equal ArrayContaining{…}

[Survived] StringLiteral
src/lib/supervision.ts:473:13
     .update({ student_profile_id: input.user_id })
     .eq("id", match.id)
     .is("student_profile_id", null)
-    .select("id")
+    .select("")
     .single<{ id: string }>();
 

[Survived] ConditionalExpression
src/lib/supervision.ts:476:7
     .select("id")
     .single<{ id: string }>();
 
-  if (updateError) {
+  if (false) {
     throw toError(updateError, "Unable to link the student account.");
   }

[Killed] ObjectLiteral
src/lib/supervision.ts:480:10
     throw toError(updateError, "Unable to link the student account.");
   }
 
-  return {
-    status: "claimable",
-    linked_student_id: updatedStudent.id,
-  };
+  return {};
 }
 
killedBy: student account linking contract links only the intended row by setting student_profile_id when one match exists
statusReason: expected {} to deeply equal { status: 'claimable', …(1) }

[Killed] StringLiteral
src/lib/supervision.ts:481:13
   }
 
   return {
-    status: "claimable",
+    status: "",
     linked_student_id: updatedStudent.id,
   };
killedBy: professor roster link status shows a claimed student as linked in the professor roster after the claim mutation succeeds
statusReason: expected { status: '', …(1) } to deeply equal { status: 'claimable', …(1) }
